README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org9676b05)
2.  [Resumo e/ou informação extra:](#org1828d51)
3.  [Versão:](#org6fb2b0b)
4.  [Data:](#orge57e1d6)
5.  [Autor de Contato:](#org3f801e2)
6.  [Lista dos Autores:](#org85cc6ce)
7.  [Áreas de pesquisa vinculadas:](#org813acee)
8.  [Vinculo com:](#org28c17ee)
9.  [Paradigmas:](#orgbb255e2)
10. [Tipo de Interface:](#orgab01793)
11. [Plataformas Suportadas:](#orgce3cc6c)
12. [Linguagens Utilizadas:](#org885d1cf)
13. [Bibliotecas Utilizadas (dependências):](#orgcd0b94f)
14. [Softwares utilizados (dependências)](#org2cc69b2)
15. [Tipo de Licença:](#org9500115)
16. [Links:](#org5d498d8)


<a id="org9676b05"></a>

# Nome do Software (ou Biblioteca):

-   CÁLCULO DE TRAJETÓRIA DIRECIONAL PARA PERFURAÇÃO DE POÇOS DE PETRÓLEO: TIPO 1 - BUILD AND HOLD

ProjetoEngenharia-CalculoDaTrajetoriaDirecionalParaperfuracaoDePocosDePetroleo-TIPO-1-BUILD-AND-HOLD


<a id="org1828d51"></a>

# Resumo e/ou informação extra:

-   Desenvolver uma solução para o cálculo da trajetória em 2D de um projeto de

poço vertical e direcional.


<a id="org6fb2b0b"></a>

# Versão:

-   1.0.


<a id="orge57e1d6"></a>

# Data:

-   2016/2 - segundo semestre.


<a id="org3f801e2"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org85cc6ce"></a>

# Lista dos Autores:

-   ANTÔNIO JOSÉ DOS REIS NETO
-   TATIANA VITÓRIO ISIDORIO
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org813acee"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Engenharia de Poço


<a id="org28c17ee"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="orgbb255e2"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="orgab01793"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="orgce3cc6c"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org885d1cf"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="orgcd0b94f"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org2cc69b2"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="org9500115"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org5d498d8"></a>

# Links:

